dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/TIMA1_1.0.xml
        <register id="TIMA1_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="Z" description="Zero event SET" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="L" description="Load event SET" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCD0" description="Capture or compare down event SET" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCD1" description="Capture or compare down event SET" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCU0" description="Capture or compare up event SET" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCU1" description="Capture or compare up event SET" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="F" description="Fault event SET" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="TOV" description="Trigger Overflow event SET" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCD4" description="Compare down event 4 SET" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCD5" description="Compare down event 5 SET" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCU4" description="Compare up event 4 SET" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
            <bitfield id="CCU5" description="Compare up event 5 SET" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="SET" value="0x1" description="Event Set"/>
            </bitfield>
        </register>
        <register id="TIMA1_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="Z" description="Zero event CLEAR" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="L" description="Load event CLEAR" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCD0" description="Capture or compare down event CLEAR" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCD1" description="Capture or compare down event CLEAR" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCU0" description="Capture or compare up event CLEAR" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCU1" description="Capture or compare up event CLEAR" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="F" description="Fault event CLEAR" begin="24" end="24" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="TOV" description="Trigger Overflow event CLEAR" begin="25" end="25" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCD4" description="Compare down event 4 CLEAR" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCD5" description="Compare down event 5 CLEAR" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCU4" description="Compare up event 4 CLEAR" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
            <bitfield id="CCU5" description="Compare up event 5 CLEAR" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect."/>
                <bitenum id="CLR" value="0x1" description="Event Clear"/>
            </bitfield>
        </register>
