dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/TIMA1_1.0.xml
        <register id="TIMA1_PL" width="32" offset="0xA0" description="Counter Register">
            <bitfield id="PHASE" description="Phase Load value" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMA1_DBCTL" width="32" offset="0xA4" description="Dead Band insertion control register">
            <bitfield id="RISEDELAY" description="Rise Delay
The number of TIMCLK periods inserted between the fall of CCPi and the rise of CCPAo." begin="11" end="0" width="12" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFF" description="Maximum Value"/>
            </bitfield>
            <bitfield id="FALLDELAY" description="Fall Delay
The number of TIMCLK periods inserted between the fall of CCPi and the rise of CCPBo" begin="27" end="16" width="12" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFF" description="Maximum Value"/>
            </bitfield>
            <bitfield id="M1_ENABLE" description="Dead Band Mode 1 Enable." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Disabled"/>
                <bitenum id="ENABLED" value="0x1" description="Enabled"/>
            </bitfield>
        </register>
        <register id="TIMA1_TSEL" width="32" offset="0xB0" description="Trigger Select">
            <bitfield id="ETSEL" description="External Trigger Select. #br# This selects which System Event is used if the input filter selects trigger.  
Triggers 0-15 are used to connect triggers generated by other timer modules in the same power domain. Refer to the SoC datasheet to get details.
Triggers 16 and  17 are connected to event manager subscriber ports.
Event lines 18-31 are reserved for future use." begin="4" end="0" width="5" rwaccess="R/W">
                <bitenum id="TRIG0" value="0x0" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG1" value="0x1" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG2" value="0x2" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG3" value="0x3" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG4" value="0x4" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG5" value="0x5" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG6" value="0x6" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG7" value="0x7" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG8" value="0x8" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG9" value="0x9" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG10" value="0xA" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG11" value="0xB" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG12" value="0xC" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG13" value="0xD" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG14" value="0xE" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG15" value="0xF" description="TRIGx = External trigger input from timer x (if available) in the same power domain as the current timer."/>
                <bitenum id="TRIG_SUB0" value="0x10" description="TRIG_SUBx = External trigger input from subscriber port x."/>
                <bitenum id="TRIG_SUB1" value="0x11" description="TRIG_SUBx = External trigger input from subscriber port x."/>
            </bitfield>
            <bitfield id="TE" description="Trigger Enable.
This selects whether a trigger is enabled or not for this counter  
0x0 = Triggers are not used 
0x1 = Triggers are used as selected by the ETSEL field" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Triggers are not used."/>
                <bitenum id="ENABLED" value="0x1" description="Triggers are used as selected by the IE, ITSEL and ETSEL fields."/>
            </bitfield>
        </register>
        <register id="TIMA1_FCTL" width="32" offset="0xD0" description="Fault Control Register">
            <bitfield id="FIEN" description="Fault Input Enable
This bit enables the input for fault detection." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Fault Input Disabled"/>
                <bitenum id="ENABLED" value="0x1" description="Fault Input Enabled"/>
            </bitfield>
            <bitfield id="FI" description="Fault Input
Specifies whether the overall fault condition is dependent on the sensed fault pin." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="INDEPENDENT" value="0x0" description="Overall Fault condition is not dependent on sensed input."/>
                <bitenum id="DEPENDENT" value="0x1" description="Overall Fault condition is dependent on sensed input."/>
            </bitfield>
            <bitfield id="TFIM" description="Trigger Fault Input Mask
Specifies whether the selected trigger participates as a fault input. If enabled and the trigger asserts, the trigger is treated as a fault." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Selected trigger does not participate in fault condition generation"/>
                <bitenum id="ENABLED" value="0x1" description="Selected trigger participates in fault condition generation"/>
            </bitfield>
            <bitfield id="FL" description="Fault Latch mode
Specifies whether the fault condition is latched and configures the latch clear conditions." begin="4" end="3" width="2" rwaccess="R/W">
                <bitenum id="NO_LATCH" value="0x0" description="Overall fault condition is not dependent on the F bit in RIS"/>
                <bitenum id="LATCH_SW_CLR" value="0x1" description="Overall fault condition is dependent on the F bit in RIS"/>
                <bitenum id="LATCH_Z_CLR" value="0x2" description="Fault condition is latched. Fault condition is cleared on a zero event if the fault input is 0."/>
                <bitenum id="LATCH_LD_CLR" value="0x3" description="Fault condition is latched. Fault condition is cleared on a load event if the fault input is 0."/>
            </bitfield>
            <bitfield id="FSENAC0" description="Specifies whether the analog comparator0 fault sense is high or low active" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENAC1" description="Specifies whether the analog comparator1 fault sense is high or low active" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENAC2" description="Specifies whether the analog comparator2 fault sense is high or low active" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENEXT0" description="Specifies whether the external fault pin0 sense is high or low active" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENEXT1" description="Specifies whether the external fault pin1 fault sense is high or low active" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENEXT2" description="Specifies whether the external fault pin3 fault sense is high or low active" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
        </register>
        <register id="TIMA1_FIFCTL" width="32" offset="0xD4" description="Fault input Filter control register">
            <bitfield id="FP" description="Filter Period
This field specifies the sample period for the input filter.  I.e. The input is sampled for FP timer clocks during filtering." begin="1" end="0" width="2" rwaccess="R/W">
                <bitenum id="PER_3" value="0x0" description="Filter Period 3"/>
                <bitenum id="PER_5" value="0x1" description="Filter Period 5"/>
                <bitenum id="PER_8" value="0x2" description="Filter Period 8"/>
            </bitfield>
            <bitfield id="CPV" description="Consecutive Period/Voting Select
This bit controls whether the input filter uses a stricter consecutive period count or majority voting." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CONSEC_PER" value="0x0" description="Consecutive Periods. The input must be at a specific logic level for the period defined by FP before it is passed to the filter output."/>
                <bitenum id="VOTING" value="0x1" description="Voting. The filter ignores one clock of opposite logic over the filter period. I.e. Over FP samples of the input, up to 1 sample may be of an opposite logic value (glitch) without affecting the output"/>
            </bitfield>
            <bitfield id="FILTEN" description="Filter Enable
This bit controls whether the input is filtered by the input filter or bypasses to go directly to the optional pre-scale filter and then to the edge detect." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="BYPASS" value="0x0" description="Bypass"/>
                <bitenum id="FILTERED" value="0x1" description="Filtered."/>
            </bitfield>
        </register>
        </group>

</module>